# ContinuousRailNotContinuous Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..StairRampFailures..::..ContinuousRailNotContinuous Property
BuiltInFailures..::..StairRampFailures Class See Also
---
The rail is non-continuous.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId ContinuousRailNotContinuous { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property ContinuousRailNotContinuous As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ ContinuousRailNotContinuous {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..StairRampFailures Class
Autodesk.Revit.DB Namespace